In [43]:
import pandas as pd
import numpy as np

In [7]:
dict1={
    'Names':['Kohli','Rohan','Good','Soy'],
    'Age':[23,65,22,88],
    'City':['paris','new','tokyo','gold']
}

In [8]:
dict1

{'Names': ['Kohli', 'Rohan', 'Good', 'Soy'],
 'Age': [23, 65, 22, 88],
 'City': ['paris', 'new', 'tokyo', 'gold']}

In [9]:
df=pd.DataFrame(dict1)

In [10]:
df

   Names  Age   City
0  Kohli   23  paris
1  Rohan   65    new
2   Good   22  tokyo
3    Soy   88   gold

In [12]:
df.describe()

            Age
count   4.00000
mean   49.50000
std    32.56276
min    22.00000
25%    22.75000
50%    44.00000
75%    70.75000
max    88.00000

In [14]:
df.at[1,"Names"]

'Rohan'

In [16]:
df.columns

Index(['Names', 'Age', 'City'], dtype='object')

In [25]:
var1=pd.Series(65,index=[1,2,3,4])

In [26]:
var1

1    65
2    65
3    65
4    65
dtype: int64

In [33]:
list1=[[1,2,3,4,77,5,5],[1,2,4,5,6,7,8]]

In [34]:
list1

[[1, 2, 3, 4, 77, 5, 5], [1, 2, 4, 5, 6, 7, 8]]

In [35]:
list2=pd.DataFrame(list1)

In [36]:
list2

   0  1  2  3   4  5  6
0  1  2  3  4  77  5  5
1  1  2  4  5   6  7  8

In [39]:
df["Names",index=False]

SyntaxError: invalid syntax. Maybe you meant '==' or ':=' instead of '='? (1770667536.py, line 1)

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Names   4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [41]:
var1.info()

<class 'pandas.core.series.Series'>
Index: 4 entries, 1 to 4
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 64.0 bytes

In [ ]:
df.insert()

In [46]:
x=np.array([[1,2,3],
            [4,5,6],
[7,8,9]

])
x

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [47]:
x.sum()

45

In [49]:
x.argmax(axis=0)

array([2, 2, 2], dtype=int64)